In [1]:
#Question: How to count the number of duplicates in a particular column in a data frame

In [2]:
import pandas as pd

In [19]:
users = pd.read_table('http://bit.ly/movieusers')
users.head()

   1|24|M|technician|85711
0       2|53|F|other|94043
1      3|23|M|writer|32067
2  4|24|M|technician|43537
3       5|33|F|other|15213
4   6|42|M|executive|98101

In [20]:
# read a dataset of movie reviewers into a DataFrame
user_cols = ['user_id', 'age', 'gender', 'occupation', 'zip_code']
users = pd.read_table('http://bit.ly/movieusers', sep='|', header=None, names=user_cols, index_col='user_id')

In [21]:
users.head()

         age gender  occupation zip_code
user_id
1         24      M  technician    85711
2         53      F       other    94043
3         23      M      writer    32067
4         24      M  technician    43537
5         33      F       other    15213

In [5]:
users.shape

(943, 4)

In [6]:
#Detecting Duplicate Zip codes; True if an item is identical to a previous item
users.zip_code.duplicated()

user_id
1      False
2      False
3      False
4      False
5      False
       ...
939    False
940     True
941    False
942    False
943    False
Name: zip_code, Length: 943, dtype: bool

In [7]:
#Count the number of duplicates
users.zip_code.duplicated().sum()

148

In [9]:
#Detect Duplicate dataframe rows
users.duplicated()

user_id
1      False
2      False
3      False
4      False
5      False
       ...
939    False
940    False
941    False
942    False
943    False
Length: 943, dtype: bool

In [10]:
#Count the number of duplicate dataframe rows
users.duplicated().sum()

7

In [13]:
#Examine the duplicate rows
#First- Mark Duplictes as True except the First occurance
users.loc[users.duplicated(keep='first'),:]

         age gender occupation zip_code
user_id
496       21      F    student    55414
572       51      M   educator    20003
621       17      M    student    60402
684       28      M    student    55414
733       44      F      other    60630
805       27      F      other    20009
890       32      M    student    97301

In [14]:
#Last- Mark Duplictes as False except the Last occurance
users.loc[users.duplicated(keep='last'),:]

         age gender occupation zip_code
user_id
67        17      M    student    60402
85        51      M   educator    20003
198       21      F    student    55414
350       32      M    student    97301
428       28      M    student    55414
437       27      F      other    20009
460       44      F      other    60630

In [16]:
#False- Mark All Duplictes as True
users.loc[users.duplicated(keep=False),:]

         age gender occupation zip_code
user_id
67        17      M    student    60402
85        51      M   educator    20003
198       21      F    student    55414
350       32      M    student    97301
428       28      M    student    55414
437       27      F      other    20009
460       44      F      other    60630
496       21      F    student    55414
572       51      M   educator    20003
621       17      M    student    60402
684       28      M    student    55414
733       44      F      other    60630
805       27      F      other    20009
890       32      M    student    97301

In [22]:
#Drop duplicates from dataframe
users.drop_duplicates(keep='first').shape

(936, 4)

In [23]:
users.drop_duplicates(keep='last').shape

(936, 4)

In [24]:
users.drop_duplicates(keep=False).shape

(929, 4)

In [25]:
# Consider certain columns when identifying duplicates
users.duplicated(subset=['age','zip_code']).sum()

16

In [26]:
users.drop_duplicates(subset=['age','zip_code'])

         age gender     occupation zip_code
user_id
1         24      M     technician    85711
2         53      F          other    94043
3         23      M         writer    32067
4         24      M     technician    43537
5         33      F          other    15213
...      ...    ...            ...      ...
939       26      F        student    33319
940       32      M  administrator    02215
941       20      M        student    97229
942       48      F      librarian    78209
943       22      M        student    77841

[927 rows x 4 columns]

In [28]:
users.drop_duplicates(subset=['age','zip_code']).shape

(927, 4)